# Pandas

- **Pandas** is an open source library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.
- Pandas is built on top of ***NumPy*** and makes it easy to use in NumPy-centric applications.
- Official website - *https://pandas.pydata.org/*

In [ ]:
import pandas as pd
import numpy as np

# Pandas Data Structures

Pandas consists of 2 main data structures:
- *Series*
- *DataFrame*

# Series

- A series is a one-dimensional array-like object containing an array of data (of any NumPy data type) and an associated array of data labels, called its *index*.

In [ ]:
a = pd.Series([2,3,-2,1])
a

0    2
1    3
2   -2
3    1
dtype: int64

In [ ]:
a.values

array([ 2,  3, -2,  1], dtype=int64)

In [ ]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
a[0]

2

In [ ]:
#series don't support negative indexing as numpy arrays or python lists
a[-1]

KeyError: -1

In [ ]:
a[0] = 10
a

0    10
1     3
2    -2
3     1
dtype: int64

In [ ]:
a[1:]

1    3
2   -2
3    1
dtype: int64

In [ ]:
b = pd.Series([2,3,-2,1],index=["d","b","a","c"]) #specify custom index
b

d    2
b    3
a   -2
c    1
dtype: int64

In [ ]:
b.values

array([ 2,  3, -2,  1], dtype=int64)

In [ ]:
b.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [ ]:
b['d']

2

In [ ]:
b['d'] = 6
b

d    6
b    3
a   -2
c    1
dtype: int64

In [ ]:
b[['a','b','c']]

a   -2
b    3
c    1
dtype: int64

In [ ]:
b[0:3]

d    6
b    3
a   -2
dtype: int64

In [ ]:
b[::2]

d    6
a   -2
dtype: int64

### NumPy array operations

In [ ]:
b

d    6
b    3
a   -2
c    1
dtype: int64

In [ ]:
b[b>0] #filtering with a boolean array

d    6
b    3
c    1
dtype: int64

In [ ]:
b*2 #scalar multiplication

d    12
b     6
a    -4
c     2
dtype: int64

In [ ]:
np.power(b,2) #applying math functions

d    36
b     9
a     4
c     1
dtype: int64

In [ ]:
b #origional series is unchanged

d    6
b    3
a   -2
c    1
dtype: int64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values.

In [ ]:
#creating a series from a dict
data = {"KTM":29,"PKR":24,"BRJ":33}
c = pd.Series(data)
c

KTM    29
PKR    24
BRJ    33
dtype: int64

In [ ]:
cities = ["BRJ","KTM","PKR","ITA"]
d = pd.Series(data,index=cities)
d

BRJ    33.0
KTM    29.0
PKR    24.0
ITA     NaN
dtype: float64

```NaN``` is considered in pandas to mark missing data. The ```isnull``` and ```notnull``` functions can be used to detect missing data.

In [ ]:
pd.isnull(d)

BRJ    False
KTM    False
PKR    False
ITA     True
dtype: bool

In [ ]:
pd.notnull(d)

BRJ     True
KTM     True
PKR     True
ITA    False
dtype: bool

In [ ]:
d.isnull() #Series also has this as instance objects

BRJ    False
KTM    False
PKR    False
ITA     True
dtype: bool

## Index Auto Alignment

The result of an operation between unaligned Series will have the union of the indexes involved. If a label is not found
in one Series or the other, the result will be marked as missing NaN.

In [ ]:
c

KTM    29
PKR    24
BRJ    33
dtype: int64

In [ ]:
d

BRJ    33.0
KTM    29.0
PKR    24.0
ITA     NaN
dtype: float64

In [ ]:
c + d

BRJ    66.0
ITA     NaN
KTM    58.0
PKR    48.0
dtype: float64

In [ ]:
d * 2

BRJ    66.0
KTM    58.0
PKR    48.0
ITA     NaN
dtype: float64

In [ ]:
c.name = "temperatures" #change series name

In [ ]:
c.index.name = "city" #change index name

In [ ]:
c

city
KTM    29
PKR    24
BRJ    33
Name: temperatures, dtype: int64

# DataFrame

- A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns.
- The columns can be each of a different value type (numeric, string, boolean, etc)
- It can be thought of as a dict of Series sharing the same index

There are numerous ways to construct a DataFrame, though one of the most common is from a dict of equal-length lists or NumPy arrays

In [ ]:
data = {'city':['KTM','KTM','PKR','PKR','BRJ','BRJ'],
       'day':['SUN','MON','SUN','MON','SUN','MON'],
       'temp':[23,22,25,26,30,31]}
df = pd.DataFrame(data)
df

  city  day  temp
0  KTM  SUN    23
1  KTM  MON    22
2  PKR  SUN    25
3  PKR  MON    26
4  BRJ  SUN    30
5  BRJ  MON    31

In [ ]:
pd.DataFrame(data,columns=['day','city','temp'])

   day city  temp
0  SUN  KTM    23
1  MON  KTM    22
2  SUN  PKR    25
3  MON  PKR    26
4  SUN  BRJ    30
5  MON  BRJ    31

In [ ]:
df2 = pd.DataFrame(data,columns=['day','city','temp','humidity'],
            index=['one','two','three','four','five','six'])
df2

       day city  temp humidity
one    SUN  KTM    23      NaN
two    MON  KTM    22      NaN
three  SUN  PKR    25      NaN
four   MON  PKR    26      NaN
five   SUN  BRJ    30      NaN
six    MON  BRJ    31      NaN

In [ ]:
df

  city  day  temp
0  KTM  SUN    23
1  KTM  MON    22
2  PKR  SUN    25
3  PKR  MON    26
4  BRJ  SUN    30
5  BRJ  MON    31

In [ ]:
df.columns

Index(['city', 'day', 'temp'], dtype='object')

In [ ]:
df.city #retrive a column as an attribute, returns a series

0    KTM
1    KTM
2    PKR
3    PKR
4    BRJ
5    BRJ
Name: city, dtype: object

In [ ]:
df['city'] #retrive a column using a dict-like notation, returns a series

0    KTM
1    KTM
2    PKR
3    PKR
4    BRJ
5    BRJ
Name: city, dtype: object

In [ ]:
df2.city #notice that the series have the same index as the DataFrame and their name attribute will be automatically set

one      KTM
two      KTM
three    PKR
four     PKR
five     BRJ
six      BRJ
Name: city, dtype: object

In [ ]:
df2['city'] #notice that the series have the same index as the DataFrame and their name attribute will be automatically set

one      KTM
two      KTM
three    PKR
four     PKR
five     BRJ
six      BRJ
Name: city, dtype: object

In [ ]:
#Rows can be retrived as well by position or name/label

df2.loc['three'] #label based indexing

day         SUN
city        PKR
temp         25
humidity    NaN
Name: three, dtype: object

In [ ]:
df2.iloc[0] #position based indexing

day         SUN
city        KTM
temp         23
humidity    NaN
Name: one, dtype: object

In [ ]:
df2

       day city  temp humidity
one    SUN  KTM    23      NaN
two    MON  KTM    22      NaN
three  SUN  PKR    25      NaN
four   MON  PKR    26      NaN
five   SUN  BRJ    30      NaN
six    MON  BRJ    31      NaN

In [ ]:
df2['humidity'] = np.random.randint(2,10,6) #modifying columns by assignment
df2

       day city  temp  humidity
one    SUN  KTM    23         5
two    MON  KTM    22         3
three  SUN  PKR    25         4
four   MON  PKR    26         6
five   SUN  BRJ    30         8
six    MON  BRJ    31         9

In [ ]:
df2['capital'] = df2['city'] == 'KTM' #assigning a column that doesn't exist will create a new column
df2

       day city  temp  humidity  capital
one    SUN  KTM    23         5     True
two    MON  KTM    22         3     True
three  SUN  PKR    25         4    False
four   MON  PKR    26         6    False
five   SUN  BRJ    30         8    False
six    MON  BRJ    31         9    False

In [ ]:
del df2['capital'] #deleting a column, this will change the dataframe
df2.columns

Index(['day', 'city', 'temp', 'humidity'], dtype='object')

In [ ]:
df2

       day city  temp  humidity
one    SUN  KTM    23         5
two    MON  KTM    22         3
three  SUN  PKR    25         4
four   MON  PKR    26         6
five   SUN  BRJ    30         8
six    MON  BRJ    31         9

In [ ]:
df2.drop('one') #delete a row with a certain index

       day city  temp  humidity
two    MON  KTM    22         3
three  SUN  PKR    25         4
four   MON  PKR    26         6
five   SUN  BRJ    30         8
six    MON  BRJ    31         9

In [ ]:
df2 #the dataframe is unchanged, drop returns a copy

       day city  temp  humidity
one    SUN  KTM    23         5
two    MON  KTM    22         3
three  SUN  PKR    25         4
four   MON  PKR    26         6
five   SUN  BRJ    30         8
six    MON  BRJ    31         9

In [ ]:
df2.drop('one',inplace=True) #will change the origional dataframe

In [ ]:
df2

       day city  temp  humidity
two    MON  KTM    22         3
three  SUN  PKR    25         4
four   MON  PKR    26         6
five   SUN  BRJ    30         8
six    MON  BRJ    31         9

In [ ]:
df2.drop(['two','six'])

       day city  temp  humidity
three  SUN  PKR    25         4
four   MON  PKR    26         6
five   SUN  BRJ    30         8

In [ ]:
df2.drop(columns='day') #can drop columns as well by specifying the columns attribute

      city  temp  humidity
two    KTM    22         3
three  PKR    25         4
four   PKR    26         6
five   BRJ    30         8
six    BRJ    31         9

In [ ]:
df2.drop(columns=['day','temp'])

      city  humidity
two    KTM         3
three  PKR         4
four   PKR         6
five   BRJ         8
six    BRJ         9

In [ ]:
df2 #without inplace set to True, will return a copy of the origional DataFrame

       day city  temp  humidity
two    MON  KTM    22         3
three  SUN  PKR    25         4
four   MON  PKR    26         6
five   SUN  BRJ    30         8
six    MON  BRJ    31         9

In [ ]:
df2

       day city  temp  humidity
two    MON  KTM    22         3
three  SUN  PKR    25         4
four   MON  PKR    26         6
five   SUN  BRJ    30         8
six    MON  BRJ    31         9

In [ ]:
#if the dataframe's index and columns have their name attributes set,
#these will be displayed as well
df2.index.name = 'day-count'
df2.columns.name = 'details'
df2

details    day city  temp  humidity
day-count
two        MON  KTM    22         3
three      SUN  PKR    25         4
four       MON  PKR    26         6
five       SUN  BRJ    30         8
six        MON  BRJ    31         9

In [ ]:
df.values #will return a 2D numpy ndarray

array([['KTM', 'SUN', 23],
       ['KTM', 'MON', 22],
       ['PKR', 'SUN', 25],
       ['PKR', 'MON', 26],
       ['BRJ', 'SUN', 30],
       ['BRJ', 'MON', 31]], dtype=object)

## Indexing, Selection and Filtering

In [ ]:
df3 = pd.Series(np.arange(4),index=['a','b','c','d'])
df3

a    0
b    1
c    2
d    3
dtype: int32

In [ ]:
df3['b']

1

In [ ]:
df3[1]

1

In [ ]:
df3[2:4]

c    2
d    3
dtype: int32

In [ ]:
df3[['b','a','d']]

b    1
a    0
d    3
dtype: int32

In [ ]:
df3[[1,3]]

b    1
d    3
dtype: int32

In [ ]:
df3[df3<2]

a    0
b    1
dtype: int32

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['KTM','PKR','BRJ','ITA'],
                   columns=['one','two','three','four'])

In [ ]:
data

     one  two  three  four
KTM    0    1      2     3
PKR    4    5      6     7
BRJ    8    9     10    11
ITA   12   13     14    15

In [ ]:
data['two']

KTM     1
PKR     5
BRJ     9
ITA    13
Name: two, dtype: int32

In [ ]:
data[['three','one']]

     three  one
KTM      2    0
PKR      6    4
BRJ     10    8
ITA     14   12

In [ ]:
data[:2] #selecting rows by slicing

     one  two  three  four
KTM    0    1      2     3
PKR    4    5      6     7

In [ ]:
data[data['three']>5] #filtering

     one  two  three  four
PKR    4    5      6     7
BRJ    8    9     10    11
ITA   12   13     14    15

In [ ]:
data > 5

       one    two  three   four
KTM  False  False  False  False
PKR  False  False   True   True
BRJ   True   True   True   True
ITA   True   True   True   True

In [ ]:
data[data>5]=0
data

     one  two  three  four
KTM    0    1      2     3
PKR    4    5      0     0
BRJ    0    0      0     0
ITA    0    0      0     0

In [ ]:
#selecting a subset of rows and columns using labels
data.loc['KTM',['two','three']]

two      1
three    2
Name: KTM, dtype: int32

In [ ]:
data.loc[['KTM','BRJ'],['one','two','three']]

     one  two  three
KTM    0    1      2
BRJ    0    0      0

In [ ]:
data.loc['KTM'] #selecting a row

one      0
two      1
three    2
four     3
Name: KTM, dtype: int32

In [ ]:
data['one'] #selecting a column

KTM    0
PKR    4
BRJ    0
ITA    0
Name: one, dtype: int32

In [ ]:
data

     one  two  three  four
KTM    0    1      2     3
PKR    4    5      0     0
BRJ    0    0      0     0
ITA    0    0      0     0

In [ ]:
data

     one  two  three  four
KTM    0    1      2     3
PKR    4    5      0     0
BRJ    0    0      0     0
ITA    0    0      0     0

In [ ]:
data.iloc[0]

one      0
two      1
three    2
four     3
Name: KTM, dtype: int32

In [ ]:
data.iloc[:,0]

KTM    0
PKR    4
BRJ    0
ITA    0
Name: one, dtype: int32

In [ ]:
data.iloc[:,[0,3]]

     one  four
KTM    0     3
PKR    4     0
BRJ    0     0
ITA    0     0

In [ ]:
data.iloc[:,1:3]

     two  three
KTM    1      2
PKR    5      0
BRJ    0      0
ITA    0      0

In [ ]:
data.iloc[[0,3],[1,2]]

     two  three
KTM    1      2
ITA    0      0

In [ ]:
data.iloc[[1,3],:]

     one  two  three  four
PKR    4    5      0     0
ITA    0    0      0     0

In [ ]:
data.iloc[:2,:2]

     one  two
KTM    0    1
PKR    4    5

In [ ]:
data

     one  two  three  four
KTM    0    1      2     3
PKR    4    5      0     0
BRJ    0    0      0     0
ITA    0    0      0     0

## Arithmetic and data alignment

In [ ]:
df1 = pd.DataFrame(np.arange(9).reshape((3,3)),
                   columns=list('bcd'),
                   index=['Ohio','Texas','Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [ ]:
df2 = pd.DataFrame(np.arange(12).reshape((4,3)),
                   columns=list('bde'),
                   index=['Utah','Ohio','Texas','Oregon'])
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [ ]:
df1 + df2 #returns a DataFrame whose index and columns are the unions of the ones in each DataFrame

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

## Function application and mapping

NumPy functions work fine with pandas objects

In [ ]:
df = pd.DataFrame(np.random.randint(10,20,(4,3)),
                 columns=list("bde"),
                 index=['Utah','Ohio','Texas','Oregon'])
df

         b   d   e
Utah    16  13  15
Ohio    17  12  12
Texas   10  19  18
Oregon  13  18  15

In [ ]:
np.sqrt(df)

               b         d         e
Utah    4.000000  3.605551  3.872983
Ohio    4.123106  3.464102  3.464102
Texas   3.162278  4.358899  4.242641
Oregon  3.605551  4.242641  3.872983

#### Another frequent operation is applying a function to each column or row

In [ ]:
df

         b   d   e
Utah    16  13  15
Ohio    17  12  12
Texas   10  19  18
Oregon  13  18  15

In [ ]:
f = lambda x: x.max() - x.min()

In [ ]:
df.apply(f)

b    7
d    7
e    6
dtype: int64

In [ ]:
df.apply(f,axis=1)

Utah      3
Ohio      5
Texas     9
Oregon    5
dtype: int64

In [ ]:
df.sum()

b    56
d    62
e    60
dtype: int64

In [ ]:
df.sum(axis=1)

Utah      44
Ohio      41
Texas     47
Oregon    46
dtype: int64

In [ ]:
df['b'].max()

17

In [ ]:
df['b'].min()

10

In [ ]:
df['b'].mean()

14.0

In [ ]:
df['b'] #select a column

Utah      16
Ohio      17
Texas     10
Oregon    13
Name: b, dtype: int32

In [ ]:
df['b'].idxmax()

'Ohio'

In [ ]:
df['b'].idxmin()

'Texas'

In [ ]:
df['b'].value_counts()

13    1
10    1
17    1
16    1
Name: b, dtype: int64

In [ ]:
df['b'].unique()

array([16, 17, 10, 13], dtype=int64)

In [ ]:
df.iloc[0] #select a row

b    16
d    13
e    15
Name: Utah, dtype: int32

In [ ]:
df.iloc[0].sum()

44

## Sorting

In [ ]:
s = pd.Series(range(5),index=['z','c','y','a','b'])
s

z    0
c    1
y    2
a    3
b    4
dtype: int64

In [ ]:
s.sort_index() #sorting by index

a    3
b    4
c    1
y    2
z    0
dtype: int64

In [ ]:
df = pd.DataFrame(np.arange(8).reshape((2,4)),
                 index=['three','one'],
                 columns=['d','a','b','c'])
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [ ]:
df.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [ ]:
df.sort_index(axis=1) #sorting by columns

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [ ]:
df.sort_index().sort_index(axis=1)

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [ ]:
df.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [ ]:
s

z    0
c    1
y    2
a    3
b    4
dtype: int64

In [ ]:
s.sort_values() #sorting by values

z    0
c    1
y    2
a    3
b    4
dtype: int64

In [ ]:
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [ ]:
df.sort_values(by="b") #sorting by a certain column

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [ ]:
df.sort_values(by="b",ascending=False)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3